{
    "LocaleSwitcher": {
        "en": "English",
        "fr": "Français"
    },
    "Navbar": {
        "home": "Home",
        "projects": "Projects",
        "about": "About",
        "contact": "Contact me"
    },
    "Footer": {
        "allRightsReserved": "All rights reserved",
        "privacyPolicy": "Privacy policy",
        "legalNotice": "Legal notice"
    },
    "HomePage": {
        "Welcome": {
            "hello": "Hey there!",
            "iAm": "I am",
            "a": "a",

            "frenchStudent": "french student",
            "frenchDeveloper": "french developer",
            "techSavvy": "tech savvy",
            "simRacer": "sim racer",
            "carEnthusiast": "car enthusiast",
            "intro": "As I am curious and very interested in computers, I have decided to study development at Villetaneuse since September 2023. I am currently working toward a ",
            "butInformatique": "A three-year academic program in France. It covers topics such as algorithms, databases, and software development.",

            "browseProjects": "Browse projects",

            "contactMe": "Contact me"
        },

        "StatsCard": {
            "yearsOnLinux": "Years on Linux",
            "professionalExperience": "Professional experiences",
            "hoursOfCoding": "Hours of coding"
        },

        "Traits": {
            "myTraits": "My traits",

            "eager": "Eager",
            "eagerDescription": "Enthusiastic to continuously improve my skills, I dedicate myself to doing my absolute best when facing challenges, and I see them as opportunities to learn more.",

            "driven": "Driven",
            "drivenDescription": "I deeply enjoy coding, to the extent that I can spend multiple hours, without even realizing it, to explore a new tool.",

            "curious": "Curious",
            "curiousDescription": "Everything in IT is interesting for me, so I am always seeking to learn more about it. That is why I have an important knowledge of multiple subjects."
        },

        "SelectedProjects": {
            "selectedProjects": "Selected projects",
            "learnMore": "LEARN MORE",

            "First": {
                "name": "Hosting machine setup",
                "description": "My friends and I wanted to play together but renting servers would be inefficient and cost expensive. So, I turned a friend's spare laptop into a machine that could host multiple game servers simultaneously.",
                "date": "January 2024",
                "firstTag": "Linux",
                "secondTag": "Hosting",
                "thirdTag": "Networking"
            },

            "Second": {
                "name": "Algorithms comparisons",
                "description": "This project has been made in University and it was divised in two parts. I coded 3 ways to calculate the shortest route between multiple cities. Then, I compared them to find out which is the fastest and why.",
                "date": "December 2023",
                "firstTag": "University",
                "secondTag": "Python",
                "thirdTag": "Algorithms"
            }
        }
    },
    "ContactPage": {
        "title": "Contact me",

        "letsConnect": "Let's connect!",
        "description": "My inbox is always open. If you have a question or if you want to get in touch, I'll try my best to get back to you as soon as possible.",
        
        "sendMeAMessage": "Send me a message",

        "subject": "Subject",
        "subjectPlaceholder": "Just saying hi",

        "messagePlaceholder": "Let's talk about...",

        "send": "Send"
    },
    "PrivacyPolicyPage": {
        "title": "Privacy policy",
        
        "thirdParty": "Third party",
        "thirdPartyContentP1": "Only one third party is used by this website : ",
        "thirdPartyContentP2": "It mainly tracks the number of visitors, their devices types, their devices OS, their country, the web vital, and the number of times a page has been visited. No other data is shared with any other third party, and there is not any intrusive tracking.",
        
        "cookies": "Cookies",
        "cookiesContent": "The first cookie used on this website is from Vercel, the hosting provider. Vercel uses a cookie to store an identifier for each user session, in order to avoid counting the same user multiple times. It is only used by Vercel and not shared with any other third party. The second cookie only stores the user's language preference, and it is only stored on the user's browser."
    },
    "LegalNoticePage": {
        "title": "Legal notice",

        "copyrightNotice": {
            "title": "Copyright notice",
            "description": "All content, including text, images, and graphics on this website is the property of Mathis SAMAT unless otherwise stated. This content is protected by copyright laws and international treaties. Unauthorized use, reproduction, or distribution of any material from this site is strictly prohibited without prior written consent from Mathis SAMAT."
        },

        "websiteOwner": {
            "title": "Website owner",
            "description": "The owner and administrator of this website is Mathis SAMAT. You can contact him at "
        },

        "websiteHosting": {
            "title": "Website hosting",
            "description": "This website is hosted by Vercel with the free plan."
        },

        "links": {
            "title": "Links",
            "description": "This website may contain links to external websites that are not provided or maintained by Mathis SAMAT. These links are provided solely for your convenience and reference. He shall not be responsible for the content of any linked site, or any link contained within a linked site. In addition, all links towards this website are permitted as long as the origin does not diffuse any content that could be considered as offensive."
        },

        "lawsAndDataCollection": {
            "title": "Laws and data collection",
            "descriptionP1": "Everything collected on this website is mentionned in the ",
            "privacyPolicy": "privacy policty",
            "descriptionP2": "Also, the collected data follows the General Data Protection Regulation (GDPR)."
        },

        "changes": {
            "title": "Changes to this legal notice",
            "description": "Mathis SAMAT reserves the right to update or modify this legal notice at any time without prior notice. Your use of this website following any such change constitutes your agreement to follow and be bound by the updated legal notice."
        }
    },
    "AboutPage": {
        "aboutMeSection": {
            "title": "About me",

            "description": {
                "firstPart": "I am Mathis SAMAT, a 19 year old student in France. I like science, so I specialized in Mathematics, Chemistry and Physics in secondary school.",
                "secondPart": "Throughout the years, I have discovered a lot about computers, and the more I dived into them, the more I was curious about them. After trying 3D Modeling, server hosting, image editing, writing my first lines of code, ... I was hooked, so I decided to study IT.",
                "thirdPart": "Now, I would love to join an IT company, to gain experience, and improve my skills."
            }
        },

        "tools": {
            "title": "My main tools",

            "average": "Average",
            "good": "Good",
            "beginner": "Beginner",

            "learnAtUniv": "Learnt at university",
            "selfTaught": "Learnt on my own",
            "mostlySelfTaught": "Mostly self-taught"
        },

        "outsideUniversity": {
            "title": "Outside university",

            "p1": "Besides my interest in coding, I have multiple passions that I enjoy when I am not at university or coding at home.",

            "p2": {
                "p1": "Firstly, I am a car enthusiast. I am currently getting my license, and I genuinely enjoy sim racing. As a matter of fact, I participated in a ",
                "link": "time attack competition",
                "p2": " back in 2023 whose creator is a youtuber with almost 800 000 subscribers. When I uploaded my score, I stayed for multiple days on the podium, and I ended up in 12th place at the end. I am still proud of it, since, because of school, I didn't have a lot of time to practice unlike the others, so I couldn't do a lot of tries to improve my time."
            },

            "p3": "In addition, I do like hiking in beautiful places, which helps me to stay balanced and full of energy, bringing productivity and fresh perspective to my work. Here, you can scroll to see some of the best pictures I took when hiking in my opinion.",

            "p4": "Finally, I like guitar and most specifically electric guitar. I play mainly rock, but I like to play all styles. I practice daily to improve my skills to be able to reproduce the solos of my favorite artists. Sometimes, I play with a friend who plays guitar, and a friend who plays drums and piano."
        }
    }
}