{
    "LocaleSwitcher": {
        "en": "English",
        "fr": "Français"
    },
    "Navbar": {
        "home": "Accueil",
        "projects": "Projets",
        "about": "À propos",
        "contact": "Me contacter"
    },
    "Footer": {
        "allRightsReserved": "Tous droits réservés",
        "privacyPolicy": "Politique de confidentialité",
        "legalNotice": "Mentions légales"
    },
    "HomePage": {
        "Welcome": {
            "hello": "Bonjour !",
            "iAm": "Je suis",
            "a": "un",

            "frenchStudent": "étudiant français",
            "frenchDeveloper": "développeur français",
            "techSavvy": "passionné d'informatique",
            "simRacer": "fan de SimRacing",
            "carEnthusiast": "passionné d'automobile",
            "intro": "Etant curieux et très intéressé par l'informatique, j'étudie depuis septembre 2023 la programmation à l'université de Villetaneuse en ",
            "butInformatique": "Ex-DUT Informatique. Un cursus sur trois ans qui couvre des sujets tels que l'algorithmie, la gestion des données, et la programmation logiciel.",

            "browseProjects": "Mes projets",

            "contactMe": "Me contacter"
        },

        "StatsCard": {
            "yearsOnLinux": "Années sous Linux",
            "professionalExperience": "Expériences professionnelles",
            "hoursOfCoding": "Heures de codage"
        },

        "Traits": {
            "myTraits": "Mes traits",

            "eager": "Enthousiaste",
            "eagerDescription": "Toujours enthousiaste à l'idée d'améliorer mes compétences, je me consacre à donner le meilleur de moi-même face aux défis, que je considère comme des occasions d'apprendre davantage.",

            "driven": "Passionné",
            "drivenDescription": "J'aime particulièrement coder et apprendre de nouvelles technologies, au point de pouvoir passer plusieurs heures sans m'en rendre compte à explorer un nouvel outil.",

            "curious": "Curieux",
            "curiousDescription": "Tout ce qui touche à l'informatique m'intéresse, c'est pourquoi je cherche constamment à en apprendre davantage. C'est aussi la raison pour laquelle j'ai des connaissance assez avancées dans de nombreux domaines."
        },
        
        "SelectedProjects": {
            "selectedProjects": "Projets sélectionnés",
            "learnMore": "EN SAVOIR PLUS",

            "First": {
                "name": "Configuration d'un serveur",
                "description": "Afin de pouvoir jouer avec mes amis à certains jeux vidéos en ligne, j'ai transformé un ordinateur portable en une machine sous Linux qui héberge plusieurs serveurs de jeux simultanément.",
                "date": "Janvier 2024",
                "firstTag": "Linux",
                "secondTag": "Hébergement",
                "thirdTag": "Réseau"
            },

            "Second": {
                "name": "Comparaison d'algorithmes",
                "description": "Projet universitaire qui a consisté à développer 3 méthodes de calcul permettant d'obtenir le chemin le plus rapide entre plusieurs villes, et à les comparer pour trouver laquelle est la plus rapide.",
                "date": "Décembre 2023",
                "firstTag": "Université",
                "secondTag": "Python",
                "thirdTag": "Algorithmes"
            }
        }
    },
    "ContactPage": {
        "title": "Me contacter",

        "letsConnect": "Entrons en contact !",
        "description": "Si vous souhaitez me contacter, n'hésitez pas à m'envoyer un message via le formulaire présent sur cette page. Je vous répondrai dès que possible !",
        
        "sendMeAMessage": "Envoyez-moi un message",

        "subject": "Sujet",
        "subjectPlaceholder": "Demande de renseignement",

        "messagePlaceholder": "Bonjour, j'aimerais vous parler de ...",

        "send": "Envoyer"
    },
    "PrivacyPolicyPage": {
        "title": "Politique de confidentialité",
        
        "thirdParty": "Tierces parties",
        "thirdPartyContentP1": "Une seule tierce partie est utilisée par le site : ",
        "thirdPartyContentP2": "Celle-ci traque le nombre de visiteurs, le type de leur machine, leur pays, et le nombre de fois qu'ils visitent une page. Aucune autre donnée est partagée avec une tierce partie.",
        
        "cookies": "Cookies",
        "cookiesContent": "Le premier cookie utilisé par ce site provient de Vercel, l'hébergeur du site. Il est utilisé pour stocker un identifiant unique pour chaque session, afin d'éviter de compter plusieurs fois le même utilisateur. Le second cookie utilisé par le site enregistre la langue préférée de l'utilisateur, et est stocké uniquement sur le navigateur de l'utilisateur."
    },
    "LegalNoticePage": {
        "title": "Mentions légales",

        "copyrightNotice": {
            "title": "Notice de droit d'auteur",
            "description": "Tout le contenu, y compris les textes, images et graphiques de ce site web, est la propriété de Mathis SAMAT, sauf indication contraire. Ce contenu est protégé par les lois sur le droit d’auteur et les traités internationaux. Toute utilisation, reproduction ou distribution non autorisée de tout élément de ce site est strictement interdite sans le consentement écrit préalable de Mathis SAMAT."
        },

        "websiteOwner": {
            "title": "Propriétaire du site web",
            "description": "Le propriétaire et administrateur de ce site web est Mathis SAMAT. Pour toute question ou demande d'information, vous pouvez le contacter à l'adresse "
        },

        "websiteHosting": {
            "title": "Hébergement du site web",
            "description": "Ce site est hébergé par Vercel avec le tier gratuit. Pour plus d'information sur Vercel, dirigez-vous vers leur site web."
        },

        "links": {
            "title": "Liens vers d'autres sites",
            "description": "Ce site peut contenir des liens vers d'autres sites web. Ces liens sont fournis uniquement pour votre commodité et à titre de référence. Le propriétaire du site ne saurait être tenu responsable du contenu de tout site lié, ni de tout lien contenu dans un site lié. De plus, tous les liens vers ce site web sont autorisés, à condition que le site d’origine ne diffuse aucun contenu pouvant être considéré comme offensant."
        },

        "lawsAndDataCollection": {
            "title": "Lois et collecte de données",
            "descriptionP1": "Ce site web est conforme aux lois en vigueur en France. Il ne collecte aucune donnée personnelle, hormis celles précisées dans la ",
            "privacyPolicy": "politique de confidentialité",
            "descriptionP2": "Par ailleurs, le site respecte le règlement général sur la protection des données (RGPD)."
        },

        "changes": {
            "title": "Modifications des mentions légales",
            "description": "Mathis SAMAT se réserve le droit de modifier ces mentions légales à tout moment. Les modifications prendront effet dès leur publication sur ce site. Votre utilisation de ce site web après de telles modifications constitue votre acceptation des nouvelles mentions légales. Il est donc conseillé de consulter régulièrement cette page pour prendre connaissance des éventuelles modifications."
        }
    },
    "AboutPage": {
        "aboutMeSection": {
            "title": "À propos",

            "description": {
                "firstPart": "Je m'appelle Mathis SAMAT, et je suis un étudiant de 19 ans. J'aime particulièrement la science, donc j'ai décidé de me spécialiser en Mathématiques et Physique-Chimie au lycée.",
                "secondPart": "Au fil des années, j'ai développé une passion pour l'informatique en essayant plusieurs domaines de ce vaste univers. J'ai essayé la modélisation 3D, l'hébergement, la retouche d'images, et plus encore. C'est au final la programmation qui m'a le plus passionné.",
                "thirdPart": "Je suis actuellement alternant en BUT Informatique. Je travaille en tant que développeur fullstack dans une petite entreprise où je développe des solutions orientées web."
            }
        },

        "tools": {
            "title": "Mes principaux outils",

            "average": "Assez bon",
            "good": "Maîtrisé",
            "beginner": "Débutant",

            "learnAtUniv": "Appris à l'université",
            "selfTaught": "Appris en autonomie",
            "mostlySelfTaught": "Surtout appris en autonomie"
        },

        "outsideUniversity": {
            "title": "En dehors de l'université",

            "p1": "En dehors de mon intérêt pour le développement, j'ai plusieurs passions auxquelles je me consacre entièrement lorsque je ne suis pas à l'université.",

            "p2" : {
                "p1": "Premièrement, je suis un passionné d'automobile et de simulation automobile (SimRacing). J'ai participé à une compétition organisée par un Youtuber de plus de 800 000 abonnés. Il s'agissait d'une ",
                "link": "\"course contre la montre\" où j'ai terminé à la 12ème place",
                "p2": ". Lorsque j'ai réalisé mon meilleur temps, je suis resté sur le podium pendant plusieurs jours. Cependant, je n'ai pas eu le temps de continuer d'encore m'améliorer à cause de mes études, donc d'autres personnes ont pu obtenir un meilleur temps d'ici la fin de l'évènement. Je suis toutefois très content de mon résultat étant donné que je n'ai pas eu beaucoup de temps pour m'entraîner."
            },

            "p3": "De plus, j'aime beaucoup la randonnée. J'aime découvrir de nouveaux paysages et dépasser mes limites. Cela me permet de me ressourcer et de me déconnecter de la technologie pendant un moment afin de revenir avec de nouvelles idées. Voici quelques photos de mes randonnées :",

            "p4": "Enfin, je suis passionné par la guitare, et plus spécifiquement par la guitare électrique. Je joue principalement du rock, mais j'aime jouer de tous les styles. Je m'entraîne quotidiennement afin de m'améliorer, et de reproduire fidèlement les solo de mes artistes préférés. Il m'arrive de jouer avec un amie guitariste, et un ami qui joue de la batterie et du piano."
        }
    }
}